[
  {
    "id": "rivercity-bike-rentals",
    "title": "RiverCity Bike Rentals - A Fresh Start for a City Icon",
    "client": "RiverCity HP",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1757337346/Vispaico/Images/cover_au8xoo.jpg",
    "summary": "A fresh, vibrant landing page designed to get customers rolling.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1757337346/Vispaico/Images/scene2-split_yrqkip.jpg",
        "content": [
          {
            "type": "heading",
            "text": "Project Brief: RiverCity Bike Rentals Haiphong"
          },
          {
            "type": "paragraph",
            "text": "To create a user-friendly and visually engaging website for RiverCity Bike Rentals, a motorbike rental service in Haiphong. The goal was to create a user-friendly experience that reflected the fun of driving. We focused on a clean layout and intuitive navigation, all delivered in our 3-Day website package."
          },
          {
            "type": "heading",
            "text": "Technology Stack & Justification"
          },
          {
            "type": "paragraph",
            "text": "The technology stack was chosen to deliver a fast, modern, and easily maintainable website within the accelerated 3-day timeframe."
          },
          {
            "type": "list",
            "items": [
              "**Vite:** Used as the build tool for its incredibly fast development server and optimized production builds, which results in a quicker, more efficient development cycle.",
              "**React:** The core of the application, allowing for the creation of a dynamic and responsive user interface with reusable components like the Navbar and VehicleCard.",
              "**Tailwind CSS:** A utility-first CSS framework that enabled rapid development of a clean, modern, and responsive design directly within the HTML.",
              "**Supabase:** Leveraged for backend services, including user authentication. As a Backend-as-a-Service (BaaS), it provided a scalable and secure backend without the need to manage server infrastructure."
            ]
          },
          {
            "type": "heading",
            "text": "Outcome"
          },
          {
            "type": "paragraph",
            "text": "The result is a high-performance, visually appealing website that effectively captures the excitement of exploring Haiphong on a motorbike. The clean layout and intuitive navigation make it easy for users to browse the selection, and the project successfully met the goal of being delivered within the 3-Day package, providing a powerful online presence for RiverCity Bike Rentals. The site has a modern, fresh look that appeals to both locals and tourists alike. Fitted with an dashboard to write, edit and delete blog posts as well as user dashboard to view and manage bookings."
          }
        ]
      }
    ],
    "sticker": {
      "line1": "$899 | 3 Days",
      "line2": "Business Website"
    }
  },
  {
    "id": "vispea",
    "title": "Vispea Urban Apparel Experience",
    "client": "Vispea @ VISPEA.COM",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1761023680/Vispaico/Images/cover_vispea_vhzsbl.webp",
    "summary": "Immersive Next.js storefront with Printful catalogue, PayPal checkout, atmospheric media, and branded UX.",
    "story": [
      {
        "type": "textOnly",
        "headline": "Project Overview",
        "text": "Vispea is an immersive apparel storefront built on Next.js that replaces the legacy WordPress site with a fast, highly branded ecommerce experience featuring Printful-powered products, PayPal checkout, and atmospheric media."
      },
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1761026698/Vispaico/Images/vispea_scene_tucq0a.webp",
        "content": [
          {
            "type": "heading",
            "text": "Key Features"
          },
          {
            "type": "paragraph",
            "text": "Autoplaying Cloudinary hero media, dynamic Printful product catalogue, persistent cart UX, integrated checkout, and atmospheric brand touchpoints."
          },
          {
            "type": "list",
            "items": [
              "**Hero Experience:** Cloudinary-hosted video with animated light rays, responsive header offsets, and high-contrast CTAs.",
              "**Dynamic Catalogue:** Printful API hydration with variant handling, gallery overrides, and related product suggestions.",
              "**Storefront UX:** Featured grids, configurator gallery switching, and a persistent Zustand-powered cart.",
              "**Checkout Flow:** PayPal checkout with server-side order create/capture endpoints plus optional FraudLabs screening.",
              "**Customer Outreach:** Newsletter and contact forms routed through hardened Nodemailer SMTP with honeypot spam protection.",
              "**Audio Layer:** Persistent Howler.js player with Media Session support and mobile fallbacks.",
              "**Brand Atmospherics:** LiquidEther background shader, custom typography, and irreverent copy deck."
            ]
          },
          {
            "type": "heading",
            "text": "Technology Stack"
          },
          {
            "type": "paragraph",
            "text": "Next.js 15 App Router with React 19 and TypeScript, Tailwind CSS v4 styling, Vercel Geist fonts, Zustand state, Howler.js media, Printful and PayPal REST integrations, Nodemailer SMTP, and optional FraudLabs screening with webhook verification."
          },
          {
            "type": "heading",
            "text": "Outcome"
          },
          {
            "type": "paragraph",
            "text": "Delivered an atmospheric, automated ecommerce experience that amplifies the Vispea brand, keeps operations hands-off, and provides a cinematic, high-conversion shopping journey ready to scale from day one."
          }
        ]
      }
    ],
    "sticker": {
      "line1": "$899 | 3 Days",
      "line2": "Online Store"
    }
  },
  {
    "id": "elena-vance-photo",
    "title": "Elena Vance | Photographer",
    "client": "Creative Professional",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338053/Vispaico/Images/cover_g6ljh8.jpg",
    "summary": "A minimalist portfolio to let the photography speak for itself.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338053/Vispaico/Images/scene2-split_uf6q6a.jpg",
        "content": [
          {
            "type": "heading",
            "text": "Project Brief: Elena Vance Photography Portfolio"
          },
          {
            "type": "heading",
            "text": "Objective"
          },
          {
            "type": "paragraph",
            "text": "To develop a high-performance, visually-focused, and modern portfolio website for the photographer Elena Vance. The core requirements were exceptional loading speed, a minimalistic design to let the photography stand out, and a polished user experience with subtle animations."
          },
          {
            "type": "heading",
            "text": "Technology Stack & Justification"
          },
          {
            "type": "paragraph",
            "text": "The technology stack was chosen specifically to meet the project's performance and design goals:"
          },
          {
            "type": "list",
            "items": [
              "**Gatsby (React Framework):** Chosen for its Static Site Generation (SSG) capabilities, which pre-builds the site into optimized files for blazing-fast load times and enhanced security.",
              "**React:** Enabled a modular, component-based architecture, making development efficient and maintainable.",
              "**GraphQL:** Utilized as Gatsby's native data layer to precisely query for all portfolio images from the filesystem at build time.",
              "**gatsby-plugin-image:** A critical plugin that automatically handles advanced image optimization, including modern formats, compression, and lazy-loading.",
              "**CSS Modules:** Used for styling to ensure all styles are locally scoped to their components, preventing global conflicts and making the system predictable.",
              "**Framer Motion:** Implemented to create fluid page transitions and scroll-reveal animations, elevating the user experience from static to dynamic and modern."
            ]
          },
          {
            "type": "heading",
            "text": "Outcome"
          },
          {
            "type": "paragraph",
            "text": "The result is a highly professional, minimalistic web presence that loads with exceptional speed. By leveraging Gatsby's static build process and advanced image optimization, the site effectively showcases high-resolution photography without performance penalty. The subtle animations provide a polished, memorable user experience."
          }
        ]
      }
    ],
    "sticker": {
      "line1": "$199 | 1 Day",
      "line2": "Express Website"
    }
  },
  {
    "id": "sales-page",
    "title": "Vispaico Sales Pages",
    "client": "Vispaico",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1757587663/Vispaico/Images/cover_glcirv.png",
    "summary": "Building a Sales page designed to sell your product, service, or event.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1757594832/Vispaico/Images/Land002_dwmrmy.webp",
        "content": [
          {
            "type": "heading",
            "text": "The Grand Plan"
          },
          {
            "type": "paragraph",
            "text": "The mission, should we choose to accept it, was to save the world from boring sales pages. We were on a quest to build a digital masterpiece so jaw-droppingly cool, it would make visitors want to marry it. It needed to be faster than a caffeinated cheetah and so user-friendly that even a confused squirrel could update it. Our goal: make sure the folks running the show could show off their swanky product without ever, ever having to touch a single line of code. Because nobody has time for that."
          },
          {
            "type": "heading",
            "text": "The Secret Sauce (Don't Tell Anyone)"
          },
          {
            "type": "paragraph",
            "text": "We threw a bunch of digital ingredients into a cauldron, chanted some ancient incantations, and poof! A website so magical it practically levitated. It was all about creating a mystical connection between the content and the site, so they could live happily ever after."
          },
          {
            "type": "list",
            "items": [
              "**Gatsby (The Speed Demon):** Our main wizard. Gatsby's superpower is turning our site into a static speedster, making it load faster than you can say 'buy this now.' Plus, it's so secure, even digital dragons can't get in.",
              "**React (The Lego Master):** The foundation of our wizardry. We used React to build reusable little digital Legos, so we could snap together awesome pages without the headache.",
              "**gatsby-source-contentful (The Teleporter):** This little gem acts as a secret teleporter, zapping all the juicy product info from our magical scroll directly into our super-fast site. It's like magic, but with more plugins.",
              "**GraphQL (The Data Chef):** Our head chef. It makes sure every component gets a perfectly portioned plate of data—not too much, not too little—just what it needs to cook up a beautiful page. No leftovers here!",
              "**Vercel & Webhooks (The Hyperspeed Launchpad):** The button we press to send our site into orbit. Any time the team updates something on the magical scroll, this setup automatically builds and launches a new, perfect version of the site. It's like having a team of tiny, efficient robots working 24/7.",
              "**CSS Modules (The Style Enforcer):** The fashion police for our code. They make sure that every style stays in its own little bubble, preventing any fashion faux pas or digital wardrobe malfunctions."
            ]
          },
          {
            "type": "heading",
            "text": "The Glorious Result"
          },
          {
            "type": "paragraph",
            "text": "The final outcome? A landing page so slick it could sell ice to an eskimo. We built a site that's not just a pretty face—it's a powerful tool that gives the team the keys to their own digital kingdom."
          }
        ]
      },
      {
        "type": "centeredVideo",
        "videoSrc": "https://res.cloudinary.com/kinhcode01/video/upload/v1757414784/Vispaico/Landing_Page_w5pbjl.mp4"
      }
    ],
    "sticker": {
      "line1": "$499 | 2 Days",
      "line2": "Sales Page"
    }
  },
  {
    "id": "health-vitality-reviews",
    "title": "Health Vitality Reviews | Bazooka",
    "client": "Affiliate Marketing Network",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338185/Vispaico/Images/cover_dmcjyj.jpg",
    "summary": "The Vispaico Bazooka with 6 indiviual websites that dominate your local search results.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338186/Vispaico/Images/scene2-split_wuymad.jpg",
        "content": [
          {
            "type": "heading",
            "text": "Project Brief: Health Vitality Reviews | Affiliate Website"
          },
          {
            "type": "heading",
            "text": "Objective"
          },
          {
            "type": "paragraph",
            "text": "Health Guide Reviews is a modern, responsive web application designed to provide insightful reviews and guides on various health-related products. The platform aims to help users make informed decisions about their health and wellness journey by offering curated content, featured products, and a community-driven newsletter"
          },
          {
            "type": "paragraph",
            "text": "The frontend is built with React and Vite, styled with Tailwind CSS, and utilizes a component library based on Shadcn/UI. The backend is powered by Supabase, handling features like email subscriptions through serverless functions."
          },
          {
            "type": "heading",
            "text": "Technology Stack & Justification"
          },
          {
            "type": "paragraph",
            "text": "The technology stack was chosen specifically to meet the project's performance and design goals:"
          },
          {
            "type": "list",
            "items": [
              "**Framework:** React (v18) with Vite for a fast, modern development experience and optimized builds.",
              "**Language:** TypeScript for type safety and improved developer experience.",
              "**Styling:** Tailwind CSS with PostCSS for rapid, utility-first styling and responsive design.",
              "**UI Components:** Shadcn/UI for a consistent and accessible design system.",
              "**Routing:** React Router DOM for client-side routing and navigation.",
              "**Form Management:** React Hook Form with Zod for schema validation and form handling."
            ]
          },
          {
            "type": "heading",
            "text": "Outcome"
          },
          {
            "type": "paragraph",
            "text": "The result is a highly professional affiliate website. The products were sourced by us and the hosting, domain registration and email system creation are also included. The subtle animations provide a polished, memorable user experience."
          }
        ]
      }
    ],
    "sticker": {
      "line1": "$999 | 3 Days",
      "line2": "Bazooka"
    }
  },
  {
    "id": "azure-estates",
    "title": "Azure Estates",
    "client": "Luxury Real Estate",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338345/Vispaico/Images/cover_jsxnbp.jpg",
    "summary": "A high-end, visually stunning showcase for luxury properties.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1757338346/Vispaico/Images/scene2-split_h48pxh.jpg",
        "content": [
          {
            "type": "heading",
            "text": "Objective"
          },
          {
            "type": "paragraph",
            "text": "To create a high-end, visually stunning digital showcase for Azure Estates, a luxury real estate brand. The primary goals were to deliver an immersive, cinematic user experience that reflects the premium quality of the properties, ensure exceptional performance on all devices, and provide a completely non-technical way for realtors to manage property listings."
          },
          {
            "type": "heading",
            "text": "Technology Stack & Justification"
          },
          {
            "type": "paragraph",
            "text": "The technology stack was architected to deliver a scalable, high-performance website with a fully decoupled content management system."
          },
          {
            "type": "list",
            "items": [
              "**Gatsby (React Framework):** Chosen as the core framework for its Static Site Generation (SSG) capabilities, providing unparalleled loading speed, enhanced security, and superior SEO performance.",
              "**React:** The foundation of Gatsby, enabling a modular and maintainable architecture with reusable components.",
              "**Contentful (Headless CMS):** The cornerstone of the content strategy. By decoupling the content from the code, Contentful provides a simple, secure, and user-friendly web dashboard for the Azure Estates team to manage listings without coding knowledge.",
              "**gatsby-source-contentful:** The official plugin used to act as the bridge between the Gatsby site and the Contentful API, seamlessly pulling all data into Gatsby's GraphQL layer at build time.",
              "**GraphQL:** Utilized as Gatsby's powerful and flexible data layer to ensure components only received the exact data they needed, optimizing performance.",
              "**Vercel & Webhooks:** The chosen platform for hosting and deployment, enabling a fully automated workflow where content changes in Contentful instantly trigger a new, optimized build.",
              "**CSS Modules:** Used for styling to guarantee that all styles are locally scoped, preventing collisions and making the system predictable and manageable."
            ]
          },
          {
            "type": "heading",
            "text": "Outcome"
          },
          {
            "type": "paragraph",
            "text": "The result is a sophisticated, high-performance digital platform that successfully translates the luxury of the Azure Estates brand into an immersive web experience. The key outcome is the empowerment of the Azure Estates team through the Contentful CMS, giving them complete autonomy over their property listings and providing a powerful, scalable business tool."
          }
        ]
      },
      {
        "type": "centeredVideo",
        "videoSrc": "https://res.cloudinary.com/kinhcode01/video/upload/v1757566237/Vispaico/AzureFull_vrzqhw.mp4"
      }
    ],
    "sticker": {
      "line1": "$899 | 3 Days",
      "line2": "Business Website"
    }
  },
  {
    "id": "startinde",
    "title": "StartinDE | Education Consultancy",
    "client": "StartinDE @ STARTIN-DE.COM",
    "coverImage": "https://res.cloudinary.com/kinhcode01/image/upload/v1763626083/Vispaico/Images/StartinDE_Cover_cx3mgr.webp",
    "summary": "German Educational Consultancy Website built with Next.js, Tailwind CSS, and Framer Motion for a high-performance, visually engaging experience.",
    "story": [
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1763629128/Vispaico/Images/startinDE_Homepage_h4ortx.webp",
        "content": [
          {
            "type": "heading",
            "text": "Project Brief: StartinDE"
          },
          {
            "type": "heading",
            "text": "Objective"
          },
          {
            "type": "paragraph",
            "text": "This project is a modern, full-stack web application designed for an educational consultancy that specializes in helping Vietnamese students pursue their studies in Germany. The platform serves as a central hub for students, consultants, and administrators, streamlining the complex process of applying to German universities. It provides comprehensive information, facilitates communication, and manages applications, documents, and payments."
          },
          {
            "type": "heading",
            "text": "Technology Stack & Justification"
          },
          {
            "type": "paragraph",
            "text": "The application is built on a robust and scalable technology stack, prioritizing developer experience and performance:"
          },
          {
            "type": "list",
            "items": [
              "**FRONTEND**",
              "**Next.js (v16) with React (v19):** A leading React framework for building server-rendered and statically generated web applications.",
              "**TypeScript:** For static typing, improving code quality and maintainability.",
              "**Tailwind CSS (v4):** A utility-first CSS framework for rapid UI development.",
              "**Radix UI:** For high-quality, accessible UI components.",
              "**React Hook Form & Zod:** For efficient and type-safe form management and validation.",

              "**BACKEND**",
              "**Next.js API Routes:** Serverless functions for handling API requests.",
              "**Prisma (v6):** A next-generation ORM for Node.js and TypeScript, used for database access.",
              "**SQLite:** As the database for development, with the flexibility to switch to a more robust database for production.",
              "**NextAuth.js (v4):** For secure and flexible authentication.",
              "**Nodemailer:** For sending emails (e.g., for email verification and notifications).",

              "**DEVELOPMENT & TOOLING**",
              "**ESLint:** For code linting and maintaining code quality.",
              "**tsx:** For running TypeScript scripts, such as the Prisma seed script.",
              "**dotenv-cli:** For managing environment variables.",

              "**PROJECT STRUCTURE**",

              "**The project follows a well-organized structure, separating concerns and promoting modularity:",

              "**`src/app/`: The core of the Next.js application, with routing based on the directory structure.",
              "**`(auth)/`: Authentication-related pages (login, register, forgot password).",
              "**`(dashboard)/`: Protected routes for the admin and student dashboards.",
              "**`api/`: API routes for server-side logic.",
              "**`src/components/`: Reusable React components, organized by feature (dashboard, forms, home, layout, shared, ui).",
              "**`src/lib/`: Utility functions and helper modules.",
              "**`src/prisma/`: Prisma schema definition (`schema.prisma`) and database seed script (`seed.ts`).",
              "**`src/data/`: Static data used throughout the application.",
              "**`public/`: Static assets like images and fonts."
            ]
          }
        ]
      },
      {
        "type": "splitLayout",
        "imageSrc": "https://res.cloudinary.com/kinhcode01/image/upload/v1763635937/Vispaico/Images/startinDE_Dashboards_q3fonv.webp",
        "content": [
          {
            "type": "heading",
            "text": "Operations inside dedicated dashboards"
          },
          {
            "type": "paragraph",
            "text": "Administrators orchestrate admissions, payments, and communications inside a tailored control center, while students track progress, upload documents, and receive updates in their own workspace."
          },
          {
            "type": "list",
            "items": [
              "**THE DASHBOARDS**",
              "The application features two distinct dashboards, each tailored to the needs of its users:",
              "**ADMIN DASHBOARD**",
              "**Purpose:** To provide administrators with a comprehensive overview and control over the entire platform.",
              "**Features:**",
              "**Student Management:** View, edit, and manage student profiles.",
              "**Application Management:** Track and update the status of student applications.",
              "**University & Course Management:** Add, edit, and remove university and course information.",
              "**Content Management:** Manage blog posts and other website content.",
              "**Financials:** View and manage payments.",
              "**Communication:** Send messages to students and consultants.",
              "**STUDENT DASHBOARD**",
              "**Purpose:** To empower students with the tools and information they need to manage their study abroad journey.",
              "**Features:**",
              "**Profile Management:** Update personal information and academic profile.",
              "**University & Course Search:** Explore and shortlist universities and courses.",
              "**Application Tracking:** Monitor the status of their applications in real-time.",
              "**Document Upload:** Securely upload and manage required documents.",
              "**Communication:** Communicate with consultants and receive notifications.",
              "**Task Management:** Keep track of important deadlines and tasks."
            ]
          }
        ]
      }
    ],
    "sticker": {
      "line1": "$899 | 3 Days",
      "line2": "Consulting Website"
    }
  }
]